using System;

namespace Lesson_3___Branching_algorithms
{
    internal class Program
    {
        public static void Main(string[] args)
        {
            /*Обязательная задача*. Ввести целочисленные координаты трех вершин прямоугольника,
             стороны которого параллельны координатным осям. Найти координаты его четвертой вершины.
             Если пользователь введёт координаты точек так, что нельзя получить прямоугольник со сторонами,
             параллельными координатным осям, вывести соответствующее сообщение.*/
        }
    }
}